app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-08-30 14:47:49.714530"], ["updated_at", "2018-08-30 14:47:49.714530"]]
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-08-30 14:47:49.706122"], ["updated_at", "2018-08-30 14:47:49.706122"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]
---
  def upload
  CSV.foreach(params[:songsd].path, headers: true) do |song|
    @song = Song.create(title: song[0])
    @song.artist.find_or_create_by(name: song[1]);